notes/org_mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orgmode</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://www.haider.gq/base/style.css'/> 
<link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css' /> 
<link rel='preconnect' href='https://fonts.googleapis.com'> 
<link rel='preconnect' href='https://fonts.gstatic.com' crossorigin> 
<link href='https://fonts.googleapis.com/css2?family=Poppins:ital@1&family=Roboto&display=swap' rel='stylesheet'>
<meta name='keywords' content='development, coding, programming, linux, emacs, guix'>
<link rel='icon' type='image/x-icon' href='/base/favicon.png'>
<meta name='description' content="Haider Mirza's website">
</head>
<body>
<div id="preamble" class="status">
<div class='grid-container'>
      <div class='grid-item header'>

	<a href='https://www.haider.gq' class='Header_Title'>
	  <span class='Header_Haider-Mirza'>Haider Mirza</span>
	</a>
	<ul class='Header_links'>
	  <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
	  <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	  <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	</ul>
	<input type='search' class='Sidebar_Search' placeholder='Search Posts...'>
	</div>

	<div class='grid-item main'>
	  <input type='search' class='Main_Search' placeholder='Search Posts...'>
	      <div class='main-main'> <!-- The actual main part -->
</div>
<div id="content" class="content">
<h1 class="title">Orgmode</h1>

<div id="outline-container-orga9a16ab" class="outline-2">
<h2 id="orga9a16ab">Orgmode</h2>
<div class="outline-text-2" id="text-orga9a16ab">
<p>
Orgmode, the overpowered feature of <a href="emacs.html#ID-f8b81c21-7c7e-410e-82ad-046fa5fa4c55">Emacs</a> that just makes your brain explode.
You can do almost anything in Orgmode when it comes to documents and more.
</p>
</div>
<div id="outline-container-org3e0ea90" class="outline-3">
<h3 id="org3e0ea90">Exporting to separate formats</h3>
<div class="outline-text-3" id="text-org3e0ea90">
<p>
You can export orgmode to many other formats with the command, <b>org-export-dispatch</b>.
This is pretty incredible but if you want to have many more exporting capabilities you can install a program called pandoc which has to be installed in <a href="emacs.html#ID-f8b81c21-7c7e-410e-82ad-046fa5fa4c55">Emacs</a> (ox-pandoc) and on your system (pandoc).
</p>
</div>
</div>
<div id="outline-container-org589cd72" class="outline-3">
<h3 id="org589cd72">Mathematics in Orgmode</h3>
<div class="outline-text-3" id="text-org589cd72">
<p>
Just like Latex, Orgmode supports many symbols.
I have created a note specifically on this topic: <a href="orgmode_mathmatics.html#ID-9d908aa4-c486-4793-b4d4-78c9a3a6ca08">Orgmode-mathmatics</a>
</p>
</div>
</div>
<div id="outline-container-org760048c" class="outline-3">
<h3 id="org760048c">OrgAgenda</h3>
<div class="outline-text-3" id="text-org760048c">
<p>
OrgAgenda is an amazing way to manage your workflow, I have created a note specifically on this topic: <a href="orgagenda.html#ID-2a6f1766-46c8-4210-bbea-5652c2caaf09">OrgAgenda</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org4d7d6f3" class="outline-2">
<h2 id="org4d7d6f3">Links to this note</h2>
<div class="outline-text-2" id="text-org4d7d6f3">
<ul class="org-ul">
<li><a href="./org_roam.html">Org-roam</a></li>
<li><a href="./emacs_packages.html">Emacs Packages</a></li>
<li><a href="./orgmode_mathmatics.html">Orgmode-mathmatics</a></li>
<li><a href="./org_reveal.html">Org-reveal</a></li>
<li><a href="./bufler.html">Bufler</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
</div>
		    </div>
		<div class='grid-item sidebar'>
		  <h2>Socials</h2>
		  <ul class='sidebar-socials'>
		    <li><a href='mailto:haider@haider.gq'><i class='fa-solid fa-envelope'></i> Email</a></li>
		    <li class='irc' onclick='alert('My Username is Haider,
You can find me in Libera.Chat on these channels:
- #tropin 
- #systemcrafters 
- #guix');'><i class='fa-solid fa-message'></i> IRC/Matrix</li>
		    <li><a href='https://www.github.com/Haider-Mirza'><i class='fa-brands fa-github'></i> Github</a></li>
		  </ul>
		  <h2>Projects</h2>
		  <ul class='sidebar-projects'>
		    <li><a href='https://www.github.com/Haider-Mirza/Spinter'> Spinter</a></li>
		  </ul>
		</div>
		<div class='grid-item footer'>
		  <p>Created by Haider Mirza with orgmode in emacs</p>
		</div>
	      </div>
</div>
</body>
</html>
